In [1]:
import os
import requests
import re
import pandas as pd
import numpy as np
import psycopg
from sqlalchemy import create_engine
import dotenv


dotenv.load_dotenv()

True

## ACS Median Household Income

In [ ]:
API_KEY = os.getenv("censuskey")
YEARS = list(range(2010, 2025))

OUT_DIR = "data/acs_income/"
os.makedirs(OUT_DIR, exist_ok=True)

BASE_URL = "https://api.census.gov/data/{year}/acs/acs1"
params = {
    "get": "NAME,B19013_001E",
    "for": "metropolitan statistical area/micropolitan statistical area:*",
    "key": API_KEY
}

In [ ]:
def pull_acs_year(year):
    """Pull ACS income data for a single year."""
    url = BASE_URL.format(year=year)
    response = requests.get(url, params=params)

    if response.status_code != 200:
        print(f"Error fetching {year}: {response.text}")
        return None

    data = response.json()

    df = pd.DataFrame(data[1:], columns=data[0])
    df["year"] = year

    df["B19013_001E"] = pd.to_numeric(df["B19013_001E"], errors="coerce")

    return df

In [7]:
all_years = []

print("Downloading ACS B19013 (Median Household Income) for all years...\n")

for year in YEARS:
    print(year)
    try:
        df_year = pull_acs_year(year)
    except Exception as e:
        print(f"Error fetching {year}: {e}")
        continue
    
    if df_year is not None:
        df_year.to_csv(f"{OUT_DIR}/acs_income_{year}.csv", index=False)
        all_years.append(df_year)


if all_years:
    full_df = pd.concat(all_years, ignore_index=True)
    full_df.to_csv("data/acs_income_all_years.csv", index=False)
    print("\nSaved merged file: data/acs_income_all_years.csv")

print("\nDone.")

Downloading ACS B19013 (Median Household Income) for all years...

2010
2011
2012
2013
2014
2015
2016
2017
2018
2019
2020
Error fetching 2020: <!doctype html><html lang="en"><head><title>HTTP Status 404 ? Not Found</title><style type="text/css">body {font-family:Tahoma,Arial,sans-serif;} h1, h2, h3, b {color:white;background-color:#525D76;} h1 {font-size:22px;} h2 {font-size:16px;} h3 {font-size:14px;} p {font-size:12px;} a {color:black;} .line {height:1px;background-color:#525D76;border:none;}</style></head><body><h1>HTTP Status 404 ? Not Found</h1></body></html>
2021
2022
2023
2024

Saved merged file: data/acs_income_all_years.csv

Done.

In [374]:
dfa = pd.read_csv("data/acs_income_all_years.csv")

dfa = dfa.rename(columns={
    "B19013_001E": "median_income",
    "metropolitan statistical area/micropolitan statistical area": "msa_code",
    "NAME": "msa_name"
})

In [375]:
dfa.shape

(7297, 4)

In [376]:
df_wide = dfa.pivot_table(
    index=["msa_code", "msa_name"],
    columns="year",
    values="median_income"
).add_prefix("income_").reset_index()

In [54]:
df_wide.shape

(771, 16)

In [249]:
def split_msa_name(name):
    """
    - Remove trailing " Metro Area", " Micro Area", " Metro", " Micro" if present.
    - Split into name_part and state_part by the last comma.
    - alt_name: substring after the FIRST hyphen in name_part (everything after that hyphen, trimmed).
    - alt_state: substring after the FIRST hyphen in state_part (everything after that hyphen, trimmed).
    - msa_canonical: base_name + ', ' + base_state with hyphen-blocks removed.
    Returns (msa_canonical, alt_name, alt_state)
    """
    if pd.isna(name):
        return (None, None, None)

    s = str(name).strip()

    # 1) Remove trailing labels like " Metro Area", " Micro Area", " Metro", " Micro"
    s = re.sub(r'\s+(Micro Area|Metro Area|Micro|Metro)\s*$', '', s, flags=re.IGNORECASE).strip()

    # 2) Split by the last comma to separate city-part and state-part
    if ',' in s:
        name_part, state_part = [p.strip() for p in s.rsplit(',', 1)]
    else:
        # fallback: no comma present
        name_part, state_part = s, ''

    # 3) Extract alternate name: portion after first hyphen (if present) in name_part
    hyphen_idx = name_part.find('-')
    if hyphen_idx != -1:
        alt_name = name_part[hyphen_idx+1:].strip()
        base_name = name_part[:hyphen_idx].strip()
    else:
        alt_name = ''
        base_name = name_part.strip()

    # 4) Extract alternate state: portion after first hyphen (if present) in state_part
    # e.g., "VA-NC" -> base_state = "VA", alt_state = "NC"
    hyphen_state_idx = state_part.find('-')
    if hyphen_state_idx != -1:
        alt_state = state_part[hyphen_state_idx+1:].strip()
        base_state = state_part[:hyphen_state_idx].strip()
    else:
        slash_state_idx = state_part.find('/')
        if slash_state_idx != -1:
            alt_state = state_part[slash_state_idx+1:].strip()
            base_state = state_part[:slash_state_idx].strip()
        else:
            alt_state = ''
            base_state = state_part.strip()

    # 5) Compose a canonical name: "{base_name}, {base_state}" or just base_name if no state
    if base_state:
        msa_canonical = f"{base_name}, {base_state}"
    else:
        msa_canonical = base_name

    # Final cleanup: remove duplicate spaces
    msa_canonical = re.sub(r'\s+', ' ', msa_canonical).strip()
    alt_name = re.sub(r'\s+', ' ', alt_name).strip()
    alt_state = re.sub(r'\s+', ' ', alt_state).strip()

    return msa_canonical, alt_name if alt_name else '', alt_state if alt_state else ''

In [250]:
results = df_wide["msa_name"].apply(split_msa_name)
df_wide[["msa", "alternate_name", "alternate_state"]] = pd.DataFrame(results.tolist(), index=df_wide.index)
df_wide = df_wide.drop(["msa_name", "msa_code"], axis=1)

In [251]:
aggregation_functions = {"income_2010": 'sum', "income_2011": 'sum', "income_2012": 'sum', "income_2013": 'sum', "income_2014": 'sum', "income_2015": 'sum', "income_2016": 'sum', "income_2017": 'sum', "income_2018": 'sum', "income_2019": 'sum', "income_2021": 'sum', "income_2022": 'sum', "income_2023": 'sum', "income_2024": 'sum', 'alternate_name': '-'.join, 'alternate_state': '-'.join}
df_wide_merged = df_wide.groupby(df_wide['msa'], as_index=False).aggregate(aggregation_functions)

In [252]:
df_wide_merged['alternate_name'] = df_wide_merged['alternate_name'].str.strip('-')
df_wide_merged['alternate_state'] = df_wide_merged['alternate_state'].str.strip('-')
df_wide_merged.head(7)

year,msa,income_2010,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,income_2017,income_2018,income_2019,income_2021,income_2022,income_2023,income_2024,alternate_name,alternate_state
0,"Aberdeen, WA",40019.0,40993.0,42057.0,41315.0,43356.0,44122.0,49623.0,47445.0,48255.0,61026.0,54631.0,62523.0,67221.0,59619.0,,
1,"Abilene, TX",40630.0,40659.0,43407.0,44149.0,44303.0,47420.0,48016.0,51130.0,48021.0,54808.0,54037.0,62660.0,61262.0,63390.0,,
2,"Adrian, MI",45563.0,44509.0,48224.0,45938.0,46739.0,48279.0,51918.0,56515.0,55378.0,53865.0,61257.0,67267.0,63952.0,71632.0,,
3,"Aguadilla, PR",14313.0,14951.0,15339.0,15323.0,15886.0,14485.0,14546.0,16645.0,17064.0,16311.0,17926.0,19966.0,21290.0,24351.0,Isabela-Isabela-San Sebasti?n-Isabela-San Seba...,
4,"Akron, OH",46521.0,47032.0,49731.0,49984.0,50538.0,51580.0,51598.0,56106.0,60019.0,57158.0,63367.0,66652.0,70125.0,71364.0,,
5,"Alamogordo, NM",0.0,35308.0,40583.0,44102.0,42603.0,36142.0,43646.0,43887.0,42591.0,39371.0,51214.0,54093.0,50762.0,56354.0,,
6,"Albany, GA",34002.0,32775.0,34469.0,34756.0,39071.0,40143.0,40667.0,43614.0,44896.0,40625.0,48659.0,48376.0,53056.0,56851.0,,

In [ ]:
df_wide_merged["msa_canonical"] = df_wide_merged["msa"].str.split(",", n=1).str[0].str.strip()
df_wide_merged["msa_state"] = df_wide_merged["msa"].str.split(",", n=1).str[1].str.strip()

In [254]:
numeric_cols = df_wide_merged.select_dtypes(include=[np.number]).columns
df_wide_merged["has_zero"] = df_wide_merged[numeric_cols].eq(0).any(axis=1)

df_wide_merged.loc[df_wide_merged["has_zero"], "alternate_name"] = (
    df_wide_merged.loc[df_wide_merged["has_zero"], "alternate_name"].fillna("") +
    "-" +
    df_wide_merged.loc[df_wide_merged["has_zero"], "msa_canonical"]
)

df_wide_merged.loc[df_wide_merged["has_zero"], "alternate_state"] = (
    df_wide_merged.loc[df_wide_merged["has_zero"], "alternate_state"].fillna("") +
    "-" +
    df_wide_merged.loc[df_wide_merged["has_zero"], "msa_state"]
)

df_wide_merged["alternate_name"] = df_wide_merged["alternate_name"].str.strip("-")
df_wide_merged["alternate_state"] = df_wide_merged["alternate_state"].str.strip("-")

rows_with_zero = df_wide_merged[df_wide_merged["has_zero"]].reset_index(drop=True)
rows_clean = df_wide_merged[~df_wide_merged["has_zero"]].reset_index(drop=True)

In [255]:
def rows_should_merge(row_a, row_b):
    """
    Returns True if row_a and row_b represent the same metro area.
    """
    # Same state, OR state appears in alternate states
    state_match = (
        row_a["msa_state"] == row_b["msa_state"] or
        row_a["msa_state"] in str(row_b["alternate_state"]) or
        row_b["msa_state"] in str(row_a["alternate_state"])
    )

    # Check names
    name_match = (
        row_a["msa_canonical"] in str(row_b["alternate_name"]) or
        row_b["msa_canonical"] in str(row_a["alternate_name"]) or
        row_a["msa_canonical"] == row_b["msa_canonical"]
    )

    return state_match and name_match

In [256]:
rows_with_zero.head()

year,msa,income_2010,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,income_2017,income_2018,income_2019,income_2021,income_2022,income_2023,income_2024,alternate_name,alternate_state,msa_canonical,msa_state,has_zero
0,"Alamogordo, NM",0.0,35308.0,40583.0,44102.0,42603.0,36142.0,43646.0,43887.0,42591.0,39371.0,51214.0,54093.0,50762.0,56354.0,Alamogordo,NM,Alamogordo,NM,True
1,"Albemarle, NC",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,65456.0,59681.0,Albemarle,NC,Albemarle,NC,True
2,"Allegan, MI",44847.0,50508.0,50078.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Allegan,MI,Allegan,MI,True
3,"Amherst Town, MA",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,79969.0,81732.0,Northampton-Amherst Town,MA,Amherst Town,MA,True
4,"Anderson Creek, NC",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,70664.0,73391.0,Anderson Creek,NC,Anderson Creek,NC,True

In [257]:
rows_with_zero["cluster_id"] = np.arange(len(rows_with_zero))  # initial unique group for each row

changed = True
while changed:
    changed = False
    for i in range(len(rows_with_zero)):
        for j in range(i + 1, len(rows_with_zero)):
            row_a = rows_with_zero.iloc[i]
            row_b = rows_with_zero.iloc[j]

            # If they belong to same metro → assign the same cluster_id
            if rows_should_merge(row_a, row_b):
                # Merge cluster IDs (use the minimum to keep it stable)
                old_cluster = rows_with_zero.at[j, "cluster_id"]
                new_cluster = rows_with_zero.at[i, "cluster_id"]
                if old_cluster != new_cluster:
                    rows_with_zero.loc[j, "cluster_id"] = new_cluster
                    changed = True

In [258]:
agg_funcs = {"msa": 'first', "msa_canonical": 'first', "msa_state": 'first'}
aggregation_functions.update(agg_funcs)

merged_df = (
    rows_with_zero.groupby("cluster_id")
       .agg(aggregation_functions)
       .reset_index(drop=True)
)

In [272]:
df_wide_clean = pd.concat([rows_clean, merged_df], ignore_index=True)
df_wide_clean = df_wide_clean.drop(columns=["has_zero", "msa_canonical", "msa_state", "alternate_name", "alternate_state"], axis=1)
df_wide_clean.head()

year,msa,income_2010,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,income_2017,income_2018,income_2019,income_2021,income_2022,income_2023,income_2024
0,"Aberdeen, WA",40019.0,40993.0,42057.0,41315.0,43356.0,44122.0,49623.0,47445.0,48255.0,61026.0,54631.0,62523.0,67221.0,59619.0
1,"Abilene, TX",40630.0,40659.0,43407.0,44149.0,44303.0,47420.0,48016.0,51130.0,48021.0,54808.0,54037.0,62660.0,61262.0,63390.0
2,"Adrian, MI",45563.0,44509.0,48224.0,45938.0,46739.0,48279.0,51918.0,56515.0,55378.0,53865.0,61257.0,67267.0,63952.0,71632.0
3,"Aguadilla, PR",14313.0,14951.0,15339.0,15323.0,15886.0,14485.0,14546.0,16645.0,17064.0,16311.0,17926.0,19966.0,21290.0,24351.0
4,"Akron, OH",46521.0,47032.0,49731.0,49984.0,50538.0,51580.0,51598.0,56106.0,60019.0,57158.0,63367.0,66652.0,70125.0,71364.0

In [273]:
df_wide_clean.to_csv("data/clean/acs.csv", index=False)

## Zillow Home Values

In [180]:
dfz = pd.read_csv("data/Metro_zhvi_uc_sfrcondo_tier_0.33_0.67_sm_sa_month.csv")
dfz = dfz.drop(index=0)

id_cols = ["SizeRank", "RegionName", "StateName"]
date_cols = dfz.columns.tolist()[5:]

date_map = {col: pd.to_datetime(col) for col in date_cols}

filtered_date_cols = [
    col for col, dt in date_map.items()
    if 2010 <= dt.year <= 2024
]

In [156]:
def rename_date(colname):
    dt = date_map[colname]
    return f"{dt.month:02d}_{dt.year}"

rename_dict = {col: rename_date(col) for col in filtered_date_cols}
rename_id = {"SizeRank": "size_rank", "RegionName": "msa", "StateName": "state"}
rename_dict.update(rename_id)
dfz = dfz[id_cols + filtered_date_cols].rename(columns=rename_dict)

In [158]:
dfz.head()

,size_rank,msa,state,01_2010,02_2010,03_2010,04_2010,05_2010,06_2010,07_2010,...,03_2024,04_2024,05_2024,06_2024,07_2024,08_2024,09_2024,10_2024,11_2024,12_2024
1,1,"New York, NY",NY,399354.882716,399519.820521,399482.210266,399476.208151,399297.663648,399682.109716,400112.508609,...,655683.238440,661880.302215,666606.556778,669731.857358,672518.169433,676315.011580,680399.785137,683974.855077,686785.434302,688595.396024
2,2,"Los Angeles, CA",CA,404247.389244,404561.049877,404793.087682,406760.476403,409659.876725,409875.732908,408105.774248,...,919825.014151,923301.984687,929212.755596,933178.926368,937569.744799,942772.834464,949218.427519,954458.219656,958972.847823,963008.235542
3,3,"Chicago, IL",IL,200780.027386,200420.954497,199416.950248,199572.730379,199105.819092,199476.540062,197900.090347,...,315135.318149,318008.305350,320129.700397,321353.747264,322090.274123,323012.925773,324017.009887,324995.489885,326034.772032,327283.074125
4,4,"Dallas, TX",TX,149839.241559,149692.161784,149459.383821,149594.574906,149701.150652,149778.790124,149429.757985,...,377695.406157,378674.546122,378819.903291,378148.409013,377199.762699,376541.550655,376341.666348,376234.690443,375943.400929,375414.033831
5,5,"Houston, TX",TX,151236.924611,151322.736620,151564.583654,152008.147220,152365.253157,152323.388202,151727.170577,...,310989.777251,312024.735566,312567.827170,312447.677123,312078.517416,311857.177565,311793.697469,311592.334160,311253.982877,311073.274691

In [159]:
dfz.to_csv("data/clean/zillow.csv", index=False)

## FRED Mortgage

In [126]:
dff = pd.read_csv("data/MORTGAGE30US.csv")

In [127]:
dff["observation_date"] = pd.to_datetime(dff["observation_date"])
dff = dff[(dff["observation_date"].dt.year >= 2010) &
            (dff["observation_date"].dt.year <= 2024)]

dff["year"] = dff["observation_date"].dt.year
dff["month"] = dff["observation_date"].dt.month

In [134]:
dff_monthly = (
    dff.groupby(["year", "month"], as_index=False)
        .agg(mortgage_rate=("MORTGAGE30US", "mean"))
)

dff_monthly["month_year"] = dff_monthly.apply(
    lambda row: f"{int(row['month']):02d}_{int(row['year'])}", axis=1
)

In [136]:
dff_monthly = dff_monthly[["month_year", "mortgage_rate"]]
dff_monthly.head()

  month_year  mortgage_rate
0    01_2010         5.0300
1    02_2010         4.9900
2    03_2010         4.9675
3    04_2010         5.0980
4    05_2010         4.8875

In [137]:
dff_monthly.to_csv("data/clean/fred.csv", index=False)

## Merging ACS and Zillow and FRED

In [2]:
acs = pd.read_csv("data/clean/acs.csv")
zillow = pd.read_csv("data/clean/zillow.csv")

In [3]:
z_long = zillow.melt(
    id_vars=["size_rank", "msa", "state"],
    var_name="month_year",
    value_name="home_value"
)

z_long["month_year"] = pd.to_datetime(z_long["month_year"], format="%m_%Y")
z_long["year"] = z_long["month_year"].dt.year
z_long = z_long[(z_long["year"] >= 2010) & (z_long["year"] <= 2024)]

In [4]:
z_annual = (
    z_long.groupby(["msa", "state", "size_rank", "year"], as_index=False)
          .agg(annual_home_value=("home_value", "mean"))
)

z_annual_wide = z_annual.pivot_table(
    index=["msa", "state", "size_rank"],
    columns="year",
    values="annual_home_value"
).add_prefix("hvi_").reset_index()

In [5]:
z_annual_wide = z_annual_wide.drop("hvi_2020", axis=1)
z_annual_wide["area_name"] = z_annual_wide["msa"].str.split(",", n=1).str[0].str.strip()
z_annual_wide.head()

year,msa,state,size_rank,hvi_2010,hvi_2011,hvi_2012,hvi_2013,hvi_2014,hvi_2015,hvi_2016,hvi_2017,hvi_2018,hvi_2019,hvi_2021,hvi_2022,hvi_2023,hvi_2024,area_name
0,"Aberdeen, SD",SD,677,128466.018223,129721.764085,136844.320186,144571.999032,144842.587755,142865.010820,146254.553881,150959.502881,156119.800376,163390.139224,190378.873289,208634.245077,213201.604011,218334.859246,Aberdeen
1,"Aberdeen, WA",WA,473,144475.855159,135285.110388,134181.779224,132038.404219,129952.846211,133784.862024,146894.454608,162207.469344,184879.613604,207935.632358,292776.563648,330143.546965,322486.345689,326426.308667,Aberdeen
2,"Abilene, TX",TX,251,107450.932153,104133.096276,105608.221308,109253.335696,115392.217425,120833.353219,127221.494918,130786.214314,138286.603370,142891.675341,167364.130967,186875.251128,192232.207344,195453.920472,Abilene
3,"Ada, OK",OK,720,111218.218047,109442.316406,106647.770770,104595.090163,105965.283233,111292.310820,113452.749734,110952.379637,119259.670506,119461.237502,148306.344399,172989.708816,179550.212565,179987.714984,Ada
4,"Adrian, MI",MI,393,95572.573789,91184.615551,92079.570108,101534.981075,111406.675843,116501.390752,125121.081752,136988.423701,147144.068389,154832.332839,187963.740428,209744.435364,213006.830620,222754.310410,Adrian

In [6]:
z_annual_wide.to_csv("data/clean/zillow_annual.csv", index=False)

In [7]:
za = pd.read_csv("data/clean/zillow_annual.csv")
acs_zillow = pd.merge(acs, za, on="msa", how="outer", indicator="matched")
acs_zillow.head()

,msa,income_2010,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,income_2017,income_2018,...,hvi_2016,hvi_2017,hvi_2018,hvi_2019,hvi_2021,hvi_2022,hvi_2023,hvi_2024,area_name,matched
0,"Aberdeen, SD",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,146254.553881,150959.502881,156119.800376,163390.139224,190378.873289,208634.245077,213201.604011,218334.859246,Aberdeen,right_only
1,"Aberdeen, WA",40019.0,40993.0,42057.0,41315.0,43356.0,44122.0,49623.0,47445.0,48255.0,...,146894.454608,162207.469344,184879.613604,207935.632358,292776.563648,330143.546965,322486.345689,326426.308667,Aberdeen,both
2,"Abilene, TX",40630.0,40659.0,43407.0,44149.0,44303.0,47420.0,48016.0,51130.0,48021.0,...,127221.494918,130786.214314,138286.603370,142891.675341,167364.130967,186875.251128,192232.207344,195453.920472,Abilene,both
3,"Ada, OK",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,113452.749734,110952.379637,119259.670506,119461.237502,148306.344399,172989.708816,179550.212565,179987.714984,Ada,right_only
4,"Adrian, MI",45563.0,44509.0,48224.0,45938.0,46739.0,48279.0,51918.0,56515.0,55378.0,...,125121.081752,136988.423701,147144.068389,154832.332839,187963.740428,209744.435364,213006.830620,222754.310410,Adrian,both

In [314]:
acs_zillow["matched"].value_counts()

matched
both          516
right_only    378
left_only      58
Name: count, dtype: int64

In [8]:
acs_zillow = pd.merge(acs, za, on="msa", how="inner")
acs_zillow.shape

(516, 32)

In [13]:
acs_zillow_clean = acs_zillow[~(acs_zillow == 0).any(axis=1)]
acs_zillow_clean = acs_zillow_clean.dropna()
acs_zillow_clean.shape

(454, 32)

In [ ]:
fred = pd.read_csv("data/clean/fred.csv")

In [16]:
fred["month_year"] = pd.to_datetime(fred["month_year"], format="%m_%Y")
fred["year"] = fred["month_year"].dt.year

fred_annual = (
    fred.groupby("year", as_index=False)
        .agg(annual_mortgage_rate=("mortgage_rate", "mean"))
)

fred_annual = fred_annual[fred_annual["year"] != 2020]
fred_annual.head()

   year  annual_mortgage_rate
0  2010              4.690583
1  2011              4.455833
2  2012              3.655917
3  2013              3.981917
4  2014              4.172833

In [17]:
fred_annual.to_csv("data/clean/fred_annual.csv", index=False)

In [18]:
fred_annual = pd.read_csv("data/clean/fred_annual.csv")

fred_wide = fred_annual.pivot_table(
    index=None,
    columns="year",
    values="annual_mortgage_rate"
).add_prefix("mortgage_rate_")

fred_wide.head()

year,mortgage_rate_2010,mortgage_rate_2011,mortgage_rate_2012,mortgage_rate_2013,mortgage_rate_2014,mortgage_rate_2015,mortgage_rate_2016,mortgage_rate_2017,mortgage_rate_2018,mortgage_rate_2019,mortgage_rate_2021,mortgage_rate_2022,mortgage_rate_2023,mortgage_rate_2024
annual_mortgage_rate,4.690583,4.455833,3.655917,3.981917,4.172833,3.849,3.647708,3.991,4.539042,3.93375,2.955708,5.3275,6.795375,6.723667

In [ ]:
acs_zillow_fred = acs_zillow_clean.merge(fred_wide, how='cross')
acs_zillow_fred.head()

,msa,income_2010,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,income_2017,income_2018,...,mortgage_rate_2014,mortgage_rate_2015,mortgage_rate_2016,mortgage_rate_2017,mortgage_rate_2018,mortgage_rate_2019,mortgage_rate_2021,mortgage_rate_2022,mortgage_rate_2023,mortgage_rate_2024
0,"Aberdeen, WA",40019.0,40993.0,42057.0,41315.0,43356.0,44122.0,49623.0,47445.0,48255.0,...,4.172833,3.849,3.647708,3.991,4.539042,3.93375,2.955708,5.3275,6.795375,6.723667
1,"Abilene, TX",40630.0,40659.0,43407.0,44149.0,44303.0,47420.0,48016.0,51130.0,48021.0,...,4.172833,3.849,3.647708,3.991,4.539042,3.93375,2.955708,5.3275,6.795375,6.723667
2,"Adrian, MI",45563.0,44509.0,48224.0,45938.0,46739.0,48279.0,51918.0,56515.0,55378.0,...,4.172833,3.849,3.647708,3.991,4.539042,3.93375,2.955708,5.3275,6.795375,6.723667
3,"Akron, OH",46521.0,47032.0,49731.0,49984.0,50538.0,51580.0,51598.0,56106.0,60019.0,...,4.172833,3.849,3.647708,3.991,4.539042,3.93375,2.955708,5.3275,6.795375,6.723667
4,"Albany, GA",34002.0,32775.0,34469.0,34756.0,39071.0,40143.0,40667.0,43614.0,44896.0,...,4.172833,3.849,3.647708,3.991,4.539042,3.93375,2.955708,5.3275,6.795375,6.723667

In [ ]:
acs_zillow_fred.to_csv("data/clean/acs_zillow_fred.csv", index=False)

In [22]:
azf_long = pd.wide_to_long(acs_zillow_fred, ["income", "hvi", "mortgage_rate"], i=["msa", "area_name", "state", "size_rank"], j="year", sep="_").reset_index()
azf_long.head(50)

,msa,area_name,state,size_rank,year,income,hvi,mortgage_rate
0,"Aberdeen, WA",Aberdeen,WA,473,2010,40019.0,144475.855159,4.690583
1,"Aberdeen, WA",Aberdeen,WA,473,2011,40993.0,135285.110388,4.455833
2,"Aberdeen, WA",Aberdeen,WA,473,2012,42057.0,134181.779224,3.655917
3,"Aberdeen, WA",Aberdeen,WA,473,2013,41315.0,132038.404219,3.981917
4,"Aberdeen, WA",Aberdeen,WA,473,2014,43356.0,129952.846211,4.172833
5,"Aberdeen, WA",Aberdeen,WA,473,2015,44122.0,133784.862024,3.849000
6,"Aberdeen, WA",Aberdeen,WA,473,2016,49623.0,146894.454608,3.647708
7,"Aberdeen, WA",Aberdeen,WA,473,2017,47445.0,162207.469344,3.991000
8,"Aberdeen, WA",Aberdeen,WA,473,2018,48255.0,184879.613604,4.539042
9,"Aberdeen, WA",Aberdeen,WA,473,2019,61026.0,207935.632358,3.933750
10,"Aberdeen, WA",Aberdeen,WA,473,2021,54631.0,292776.563648,2.955708
11,"Aberdeen, WA",Aberdeen,WA,473,2022,62523.0,330143.546965,5.327500
12,"Aberdeen, WA",Aberdeen,WA,473,2023,67221.0,322486.345689,6.795375
13,"Aberdeen, WA",Aberdeen,WA,473,2024,59619.0,326426.308667,6.723667
14,"Abilene, TX",Abilene,TX,251,2010,40630.0,107450.932153,4.690583
15,"Abilene, TX",Abilene,TX,251,2011,40659.0,104133.096276,4.455833
16,"Abilene, TX",Abilene,TX,251,2012,43407.0,105608.221308,3.655917
17,"Abilene, TX",Abilene,TX,251,2013,44149.0,109253.335696,3.981917
18,"Abilene, TX",Abilene,TX,251,2014,44303.0,115392.217425,4.172833
19,"Abilene, TX",Abilene,TX,251,2015,47420.0,120833.353219,3.849000
20,"Abilene, TX",Abilene,TX,251,2016,48016.0,127221.494918,3.647708
21,"Abilene, TX",Abilene,TX,251,2017,51130.0,130786.214314,3.991000
22,"Abilene, TX",Abilene,TX,251,2018,48021.0,138286.603370,4.539042
23,"Abilene, TX",Abilene,TX,251,2019,54808.0,142891.675341,3.933750
24,"Abilene, TX",Abilene,TX,251,2021,54037.0,167364.130967,2.955708
25,"Abilene, TX",Abilene,TX,251,2022,62660.0,186875.251128,5.327500
26,"Abilene, TX",Abilene,TX,251,2023,61262.0,192232.207344,6.795375
27,"Abilene, TX",Abilene,TX,251,2024,63390.0,195453.920472,6.723667
28,"Adrian, MI",Adrian,MI,393,2010,45563.0,95572.573789,4.690583
29,"Adrian, MI",Adrian,MI,393,2011,44509.0,91184.615551,4.455833
30,"Adrian, MI",Adrian,MI,393,2012,48224.0,92079.570108,3.655917
31,"Adrian, MI",Adrian,MI,393,2013,45938.0,101534.981075,3.981917
32,"Adrian, MI",Adrian,MI,393,2014,46739.0,111406.675843,4.172833
33,"Adrian, MI",Adrian,MI,393,2015,48279.0,116501.390752,3.849000
34,"Adrian, MI",Adrian,MI,393,2016,51918.0,125121.081752,3.647708
35,"Adrian, MI",Adrian,MI,393,2017,56515.0,136988.423701,3.991000
36,"Adrian, MI",Adrian,MI,393,2018,55378.0,147144.068389,4.539042
37,"Adrian, MI",Adrian,MI,393,2019,53865.0,154832.332839,3.933750
38,"Adrian, MI",Adrian,MI,393,2021,61257.0,187963.740428,2.955708
39,"Adrian, MI",Adrian,MI,393,2022,67267.0,209744.435364,5.327500
40,"Adrian, MI",Adrian,MI,393,2023,63952.0,213006.830620,6.795375
41,"Adrian, MI",Adrian,MI,393,2024,71632.0,222754.310410,6.723667
42,"Akron, OH",Akron,OH,83,2010,46521.0,121567.080744,4.690583
43,"Akron, OH",Akron,OH,83,2011,47032.0,115448.757133,4.455833
44,"Akron, OH",Akron,OH,83,2012,49731.0,111135.741415,3.655917
45,"Akron, OH",Akron,OH,83,2013,49984.0,114122.899441,3.981917
46,"Akron, OH",Akron,OH,83,2014,50538.0,117305.270209,4.172833
47,"Akron, OH",Akron,OH,83,2015,51580.0,120560.160528,3.849000
48,"Akron, OH",Akron,OH,83,2016,51598.0,126631.501203,3.647708
49,"Akron, OH",Akron,OH,83,2017,56106.0,132711.294363,3.991000

In [ ]:
azf_long.to_csv("data/final/acs_zillow_fred_long.csv", index=False)

## Merging Zillow and FRED

In [366]:
zillow = pd.read_csv("data/clean/zillow.csv")
fred = pd.read_csv("data/clean/fred.csv")

In [367]:
fred_wide = fred.pivot_table(
    index=None,
    columns="month_year",
    values="mortgage_rate"
).add_prefix("mortgage_rate_")

fred_wide.head()

month_year,mortgage_rate_01_2010,mortgage_rate_01_2011,mortgage_rate_01_2012,mortgage_rate_01_2013,mortgage_rate_01_2014,mortgage_rate_01_2015,mortgage_rate_01_2016,mortgage_rate_01_2017,mortgage_rate_01_2018,mortgage_rate_01_2019,...,mortgage_rate_12_2015,mortgage_rate_12_2016,mortgage_rate_12_2017,mortgage_rate_12_2018,mortgage_rate_12_2019,mortgage_rate_12_2020,mortgage_rate_12_2021,mortgage_rate_12_2022,mortgage_rate_12_2023,mortgage_rate_12_2024
mortgage_rate,5.03,4.755,3.915,3.414,4.432,3.67,3.8725,4.15,4.0325,4.464,...,3.964,4.198,3.95,4.6375,3.72,2.684,3.098,6.364,6.815,6.715

In [368]:
rename_dict = {c: "hvi_" + c for c in zillow.columns.to_list()[3:]}
zillow = zillow.rename(columns=rename_dict)
zillow["area_name"] = zillow["msa"].str.split(",", n=1).str[0].str.strip()


zillow_fred = zillow.merge(fred_wide, how='cross')
zillow_fred.head()

,size_rank,msa,state,hvi_01_2010,hvi_02_2010,hvi_03_2010,hvi_04_2010,hvi_05_2010,hvi_06_2010,hvi_07_2010,...,mortgage_rate_12_2015,mortgage_rate_12_2016,mortgage_rate_12_2017,mortgage_rate_12_2018,mortgage_rate_12_2019,mortgage_rate_12_2020,mortgage_rate_12_2021,mortgage_rate_12_2022,mortgage_rate_12_2023,mortgage_rate_12_2024
0,1,"New York, NY",NY,399354.882716,399519.820521,399482.210266,399476.208151,399297.663648,399682.109716,400112.508609,...,3.964,4.198,3.95,4.6375,3.72,2.684,3.098,6.364,6.815,6.715
1,2,"Los Angeles, CA",CA,404247.389244,404561.049877,404793.087682,406760.476403,409659.876725,409875.732908,408105.774248,...,3.964,4.198,3.95,4.6375,3.72,2.684,3.098,6.364,6.815,6.715
2,3,"Chicago, IL",IL,200780.027386,200420.954497,199416.950248,199572.730379,199105.819092,199476.540062,197900.090347,...,3.964,4.198,3.95,4.6375,3.72,2.684,3.098,6.364,6.815,6.715
3,4,"Dallas, TX",TX,149839.241559,149692.161784,149459.383821,149594.574906,149701.150652,149778.790124,149429.757985,...,3.964,4.198,3.95,4.6375,3.72,2.684,3.098,6.364,6.815,6.715
4,5,"Houston, TX",TX,151236.924611,151322.736620,151564.583654,152008.147220,152365.253157,152323.388202,151727.170577,...,3.964,4.198,3.95,4.6375,3.72,2.684,3.098,6.364,6.815,6.715

In [369]:
zillow_fred.to_csv("data/clean/zillow_fred.csv", index=False)

In [370]:
zf_long = pd.wide_to_long(zillow_fred, ["hvi", "mortgage_rate"], i=["msa", "area_name", "state", "size_rank"], j="month_year", sep="_", suffix="(\\d+)_(\\d+)").reset_index()
zf_long.head(), zf_long.tail()

(            msa area_name state  size_rank month_year            hvi  \
 0  New York, NY  New York    NY          1    01_2010  399354.882716
 1  New York, NY  New York    NY          1    02_2010  399519.820521
 2  New York, NY  New York    NY          1    03_2010  399482.210266
 3  New York, NY  New York    NY          1    04_2010  399476.208151
 4  New York, NY  New York    NY          1    05_2010  399297.663648

    mortgage_rate
 0         5.0300
 1         4.9900
 2         4.9675
 3         5.0980
 4         4.8875  ,
                msa area_name state  size_rank month_year            hvi  \
 160915  Lamesa, TX    Lamesa    TX        939    08_2024  100596.120963
 160916  Lamesa, TX    Lamesa    TX        939    09_2024  101358.115495
 160917  Lamesa, TX    Lamesa    TX        939    10_2024  101368.500461
 160918  Lamesa, TX    Lamesa    TX        939    11_2024  100837.813931
 160919  Lamesa, TX    Lamesa    TX        939    12_2024  100488.938872

         mortgage_rate
 160915          6.500
 160916          6.180
 160917          6.428
 160918          6.805
 160919          6.715  )

In [371]:
zf_long["month"] = zf_long["month_year"].str.split("_", n=1).str[0].str.strip()
zf_long["year"] = zf_long["month_year"].str.split("_", n=1).str[1].str.strip()
zf_long.head()

,msa,area_name,state,size_rank,month_year,hvi,mortgage_rate,month,year
0,"New York, NY",New York,NY,1,01_2010,399354.882716,5.0300,01,2010
1,"New York, NY",New York,NY,1,02_2010,399519.820521,4.9900,02,2010
2,"New York, NY",New York,NY,1,03_2010,399482.210266,4.9675,03,2010
3,"New York, NY",New York,NY,1,04_2010,399476.208151,5.0980,04,2010
4,"New York, NY",New York,NY,1,05_2010,399297.663648,4.8875,05,2010

In [ ]:
zf_long.to_csv("data/final/zillow_fred_long.csv", index=False)

## Affordability

In [ ]:
azf_long = pd.read_csv("data/final/acs_zillow_fred_long.csv")
azf_long["affordability"] = azf_long["hvi"] / azf_long["income"]
azf_long.head()

,msa,area_name,state,size_rank,year,income,hvi,mortgage_rate,affordability
0,"Aberdeen, WA",Aberdeen,WA,473,2010,40019.0,144475.855159,4.690583,3.610182
1,"Aberdeen, WA",Aberdeen,WA,473,2011,40993.0,135285.110388,4.455833,3.300200
2,"Aberdeen, WA",Aberdeen,WA,473,2012,42057.0,134181.779224,3.655917,3.190474
3,"Aberdeen, WA",Aberdeen,WA,473,2013,41315.0,132038.404219,3.981917,3.195895
4,"Aberdeen, WA",Aberdeen,WA,473,2014,43356.0,129952.846211,4.172833,2.997344

In [ ]:
azf_long.to_csv("data/final/acs_zillow_fred_long.csv", index=False)

## ML

In [16]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score, mean_squared_error
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler

In [ ]:
azf_long = pd.read_csv("data/final/acs_zillow_fred_long.csv")

X = azf_long[["income", "mortgage_rate"]]
y = azf_long["affordability"]
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

model = LinearRegression()
model.fit(X_train, y_train)

y_pred = model.predict(X_test)
r2 = r2_score(y_test, y_pred)
mse = mean_squared_error(y_test, y_pred)
rmse = np.sqrt(mse)

coef_df = pd.DataFrame({"Feature": X.columns, "Coefficient": model.coef_})
print(f"R2: {r2}\nMSE: {mse}\nRMSE: {rmse}")
print(coef_df)

R2: 0.282674781731165
MSE: 1.235982404678637
RMSE: 1.1117474554405946
         Feature  Coefficient
0         income     0.000046
1  mortgage_rate    -0.033199

In [18]:
features = azf_long[["income", "hvi", "mortgage_rate"]]

scaler = StandardScaler()
X_scaled = scaler.fit_transform(features)

kmeans = KMeans(n_clusters=3, random_state=42)

In [ ]:
azf_long["predicted_affordability"] = model.predict(X)
azf_long["cluster"] = kmeans.fit_predict(X_scaled)
azf_long.to_csv("data/final/acs_zillow_fred_long.csv", index=False)

## Postgres DB

In [ ]:
POSTGRES_PASSWORD = os.getenv('POSTGRES_PASSWORD')

azf_long = pd.read_csv("data/final/acs_zillow_fred_long.csv")
zf_long = pd.read_csv("data/final/zillow_fred_long.csv")

In [21]:
dbserver = psycopg.connect(host='localhost', port=5433, user='postgres', password=POSTGRES_PASSWORD)
dbserver.autocommit = True

In [22]:
cursor = dbserver.cursor()

cursor.execute("DROP DATABASE IF EXISTS housing")
cursor.execute("CREATE DATABASE housing")

In [23]:
dbms = 'postgresql'
package = 'psycopg'
user = 'postgres'
password = POSTGRES_PASSWORD
host = 'localhost'
port = '5433'
db = 'housing'

engine = create_engine(f"{dbms}+{package}://{user}:{password}@{host}:{port}/{db}")
engine

Engine(postgresql+psycopg://postgres:***@localhost:5433/housing)

In [24]:
azf_long.to_sql("acs_zillow_fred_long", engine, index=False)
zf_long.to_sql("zillow_fred_long", engine, index=False)

-1